{
  "last_updated": "2026-01-10T12:26:07.530368+00:00",
  "notices": {
    "11381716": {
      "id": 11381716,
      "title": "PUD-25-0014 - 2001 Yates Road",
      "description": "Planned Unit Development at 2001 Yates Road: OS (Open Space) → PUD (Planned Unit Development)",
      "notice_text": "11/3/2026 The City Commission will consider a request to amend the Official Zoning Map referenced in Ordinance No. 3110 known as the Land Development Code of the City of Kissimmee rezoning the property hereinafter described as follows: FROM: OS (Open Space)  City TO: PUD (Planned Unit Development)  City The subject property is located at 2001 Yates Road Parcel IDs: 18-25-29-0000- 0180-0000 and 18-25-29-0000-0185-0000 Legal Descriptions: N1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB And S1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB PROPOSED ORDINANCE #25-19: AN ORDINANCE AMENDING ORDINANCE NO. 3110 KNOWN AS THE CITY OF KISSIMMEE LAND DEVELOPMENT CODE, REZONING THE PROPERTY HEREINAFTER DESCRIBED, REPEALING ALL ORDINANCES IN CONFLICT HEREWITH AND PROVIDING AN EFFECTIVE DATE. The City Commission will hold a Public Hearing on Tuesday, November 18, 2025 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida, and will consider the adoption of an Ordinance to rezone the above described property following the public hearing. A copy of the proposed Ordinance may be inspected in the office of the Development Services Department at City Hall, 101 Church Street. All interested parties may appear and be heard on the above date. Written opinion will be received until 5:30 p.m., Tuesday, November 18, 2025. Any questions may be directed to the Development Services Department at (407) 518-2140 or planning@kissimmee.gov. Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or meeting may be heard by participating in person.  Reference # PUD-25-0014 CITY COMMISSION Armstrong Zoning KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk (407) 518-2308 prior to the meeting. (FS286.26) In accordance with Florida Statues 286.0105: Any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.  NOTICE OF PUBLIC HEARING CITY COMMISSION  7890714",
      "pub_date": "2025-11-03",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/16/11381716.pdf",
      "link": "https://floridapublicnotices.com/notices/11381716",
      "image_url": null,
      "thumbnail_url": "thumbnails/11381716.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": "Tuesday, November 18, 2025 at 6:00 p.m.",
      "property_address": "2001 Yates Road",
      "zoning_change": "OS (Open Space) → PUD (Planned Unit Development)",
      "reference_num": "PUD-25-0014",
      "parcel_id": "18-25-29-0000- 0180-0000 and 18-25-29-0000-0185-0000",
      "amendment_type": {
        "code": "PUD",
        "name": "Planned Unit Development"
      },
      "pub_date_rfc822": "Mon, 03 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 03, 2025",
      "first_seen": "2025-11-04T12:38:05.429531+00:00",
      "last_seen": "2025-12-07T18:18:16.722562+00:00",
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission"
    },
    "11381714": {
      "id": 11381714,
      "title": "DRC - 2001 Yates RD",
      "description": "Notice at 2001 Yates RD: REC (Recreation) - → INST (Institutional) -",
      "notice_text": "11/3/2026 The City of Kissimmee proposes to adopt the following ordinance that would change the use of land as described below. A public hearing on this proposal will be held by the City of Kissimmee City Commission to consider the first reading of the proposed ordinance on Tuesday, November 18, 2025, at 6:00 p.m. or as soon thereafter as possible, in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida. PROPOSED ORDINANCE# 25-18: AN ORDINANCE AMENDING ORDINANCE NO. 3050 KNOWN AS THE ORDINANCE ADOPTING THE COMPREHENSIVE DEVELOPMENT PLAN FOR THE CITY OF KISSIMMEE, FLORIDA, UNDER THE AUTHORITY OF FLORIDA STATUTE 163.3184; DIRECTING THE CITY MANAGER TO AMEND THE COMPREHENSIVE LAND USE PLAN AS HEREIN PROVIDED AFTER THE PASSAGE OF THIS ORDINANCE; PROVIDING FOR A PUBLIC HEARING AS REQUIRED BY LAW; REPEALING ALL ORDINANCES IN CONFLICT HEREWITH; AND PROVIDING AN EFFECTIVE DATE. The purpose of this Public Hearing is to make a recommendation to the City Commission concerning the request to amend Ordinance No. 3050. The proposed Ordinance would amend the 2025 Future Land Use Map of the Kissimmee Comprehensive Plan by changing the land use classification for the area described below as follows: FROM: REC (Recreation) - City TO: INST (Institutional) - City The subject property is located at 2001 Yates RD. Legal Description: Parcel 1: 18-25-29-0000-0180-0000 N1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB Together with Parcel 2: 18-25-29-0000-0185-0000 S1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB The purpose of this public hearing is to consider a proposed amendment to Ordinance 3050, known as the Comprehensive Development Plan, which would change the 2025 Future Land Use Map of the Kissimmee Comprehensive Plan. The proposed amendment and the supporting documents, including a parcel description, may be inspected in the Development Services Department, City Hall, 101 Church Street, Kissimmee, Florida, between 8:00 a.m. and 5:00 p.m., Monday through Friday. Please direct any questions to the Development Services Department, (407) 518-2140 or planning@kissimmee.gov .  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person.  Reference # DRC LUPA-25-0003 CITY COMMISSION Yates Road KISSIMMEE, FLORIDA In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the City Commission with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made. In accordance with Florida Statute 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the  CITY OF KISSIMMEE NOTICE OF PUBLIC HEARING NOTICE OF LAND USE CHANGE  7890710",
      "pub_date": "2025-11-03",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/14/11381714.pdf",
      "link": "https://floridapublicnotices.com/notices/11381714",
      "image_url": null,
      "thumbnail_url": "thumbnails/11381714.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": null,
      "property_address": "2001 Yates RD",
      "zoning_change": "REC (Recreation) - → INST (Institutional) -",
      "reference_num": "DRC",
      "parcel_id": "18-25-29-0000-0180-0000 and 18-25-29-0000-0185-0000",
      "amendment_type": null,
      "pub_date_rfc822": "Mon, 03 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 03, 2025",
      "first_seen": "2025-11-04T12:38:05.429531+00:00",
      "last_seen": "2025-12-07T18:18:16.722562+00:00",
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission"
    },
    "11378596": {
      "id": 11378596,
      "title": "Miscellaneous Notices - Orlando",
      "description": "10/31/2025 TO WHOM IT MAY CONCERN: NOTICE IS GIVEN by the City of Casselberry, Florida, that the City Commission will hold a public hearing to cons...",
      "notice_text": "10/31/2025 TO WHOM IT MAY CONCERN: NOTICE IS GIVEN by the City of Casselberry, Florida, that the City Commission will hold a public hearing to consider adoption of the following ordinance:  ORDINANCE 25-1626  AN ORDINANCE OF THE CITY OF CASSELBERRY, FLORIDA, AMENDING CHAPTER 68  ROADWAY AND UTILITY CONSTRUCTION, ARTICLE IV.  COMMUNICATIONS RIGHTS-OF- WAY, TO AMEND GENERAL PERMIT REQUIREMENTS AND SECURITY REQUIREMENTS FOR COMMUNICATIONS RIGHTS-OF- WAY UTILIZATION PERMIT APPLICANTS INSTALLING AND MAINTAINING COMMUNICATIONS SERVICES FACILITIES IN THE PUBLIC RIGHTS-OF-WAY; PROVIDING FOR CODIFICATION, CONFLICTS, SEVERABILITY AND AN EFFECTIVE DATE. This notice is pursuant to the provisions of Chapter 166, Florida Statutes, and the Charter and Ordinances of the City of Casselberry, Florida, as amended and supplemented. The City Commission will consider adoption of Ordinance 25-1626 on Monday, November 17, 2025 at 5:30 p.m. or as soon thereafter as possible, in the Casselberry City Hall Commission Chambers, 95 Triplet Lake Drive, Casselberry, Florida. At the meeting, interested parties may appear and be heard with respect to the proposed Ordinance. This hearing may be continued from time to time until final action is taken by the City Commission. Copies of the proposed Ordinance are available at City Hall with the City Clerk and the same may be inspected by the public. Publish Date: October 31, 2025 Donna G. Gardner, CMC, FCPC  City Clerk  Persons are advised that, if they decide to appeal any decision made at these meetings/hearings, they will need a record of the proceedings and for such purpose, they may need to insure that a verbatim record of the proceedings is made, which record includes the testimony and evidence upon which the appeal is to be based, per Section 286.0105, Florida Statutes. Persons with disabilities needing assistance to participate in any of these proceedings should contact the A.D.A. Coordinator 48 hours in advance of the meeting at (407) 262-7700 Ext. 1150.  CITY OF CASSELBERRY, FLORIDA  NOTICE OF PUBLIC HEARING TO CONSIDER  ADOPTION OF PROPOSED ORDINANCE  7890722",
      "pub_date": "2025-10-31",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/96/11378596.pdf",
      "link": "https://floridapublicnotices.com/notices/11378596",
      "image_url": null,
      "thumbnail_url": "thumbnails/11378596.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": "Monday, November 17, 2025 at 5:30 p.m.",
      "property_address": null,
      "zoning_change": null,
      "reference_num": null,
      "parcel_id": null,
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Fri, 31 Oct 2025 00:00:00 +0000",
      "pub_date_formatted": "October 31, 2025",
      "first_seen": "2025-11-04T14:45:59.104898+00:00",
      "last_seen": "2025-11-04T14:52:01.716166+00:00"
    },
    "11345008": {
      "id": 11345008,
      "title": "Miscellaneous Notices - Orlando",
      "description": "10/2/2025 TO WHOM IT MAY CONCERN: NOTICE IS GIVEN by the City of Casselberry, Florida, that the City Commission will hold a public hearing to consi...",
      "notice_text": "10/2/2025 TO WHOM IT MAY CONCERN: NOTICE IS GIVEN by the City of Casselberry, Florida, that the City Commission will hold a public hearing to consider the enactment of an ordinance entitled:  ORDINANCE 25-1624  AN ORDINANCE OF THE CITY OF CASSELBERRY, FLORIDA, AMENDING PART III OF THE UNIFIED LAND DEVELOPMENT REGULATIONS, CHAPTER V  GLOSSARY, ARTICLE XXI - LANGUAGE AND DEFINITIONS, SECTION 5-21.2 - DEFINITION OF TERMS, TO AMEND THE DEFINITION OF VEHICULAR SERVICES, MAINTENANCE, AND LIGHT MECHANICAL REPAIR; PROVIDING FOR CODIFICATION, CONFLICTS, SEVERABILITY AND AN EFFECTIVE DATE.  *Insert Map Here*  This notice is pursuant to the provisions of Chapter 166, Florida Statutes, and the Charter and Ordinances of the City of Casselberry, Florida, as amended and supplemented. The City Commission will consider the proposed Ordinance on October 13, 2025, at 5:30 p.m. or as soon thereafter as possible, in the Casselberry City Hall Commission Chambers, 95 Triplet Lake Drive, Casselberry, Florida. At the meeting, interested parties may appear and be heard with respect to the proposed Ordinance. This hearing may be continued from time to time until final action is taken by the Commission. Copies of the proposed Ordinance are available at City Hall with the City Clerk, and the same may be inspected by the public. Publish Date: October 2, 2025 Donna G. Gardner, CMC, City Clerk Persons are advised that, if they decide to appeal any decision made at these meetings/hearings, they will need a record of the proceedings and for such purpose, they may need to ensure that a verbatim record of the proceedings is made, which record includes the testimony and evidence upon which the appeal is to be based, per Section 286.0105, Florida Statutes. Persons with disabilities needing assistance to participate in any of these proceedings should contact the A.D.A. Coordinator 48 hours in advance of the meeting at (407) 262- 7700, Ext. 1150.  CITY OF CASSELBERRY, FLORIDA NOTICE OF PUBLIC HEARING TO CONSIDER CITY CODE AMENDMENT  7876577",
      "pub_date": "2025-10-02",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/08/11345008.pdf",
      "link": "https://floridapublicnotices.com/notices/11345008",
      "image_url": null,
      "thumbnail_url": "thumbnails/11345008.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": null,
      "property_address": null,
      "zoning_change": null,
      "reference_num": null,
      "parcel_id": null,
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Thu, 02 Oct 2025 00:00:00 +0000",
      "pub_date_formatted": "October 02, 2025",
      "first_seen": "2025-11-04T14:45:59.104898+00:00",
      "last_seen": "2025-11-04T14:52:01.716166+00:00"
    },
    "11390856": {
      "id": 11390856,
      "title": "DRC - 2001 Yates RD",
      "description": "Notice at 2001 Yates RD: REC (Recreation) - → INST (Institutional) -",
      "notice_text": "11/11/2026 The City of Kissimmee proposes to adopt the following ordinance that would change the use of land as described below. A public hearing on this proposal will be held by the City of Kissimmee City Commission to consider the first reading of the proposed ordinance on Tuesday, November 18, 2025, at 6:00 p.m. or as soon thereafter as possible, in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida. PROPOSED ORDINANCE# 25-18: AN ORDINANCE AMENDING ORDINANCE NO. 3050 KNOWN AS THE ORDINANCE ADOPTING THE COMPREHENSIVE DEVELOPMENT PLAN FOR THE CITY OF KISSIMMEE, FLORIDA, UNDER THE AUTHORITY OF FLORIDA STATUTE 163.3184; DIRECTING THE CITY MANAGER TO AMEND THE COMPREHENSIVE LAND USE PLAN AS HEREIN PROVIDED AFTER THE PASSAGE OF THIS ORDINANCE; PROVIDING FOR A PUBLIC HEARING AS REQUIRED BY LAW; REPEALING ALL ORDINANCES IN CONFLICT HEREWITH; AND PROVIDING AN EFFECTIVE DATE. The purpose of this Public Hearing is to make a recommendation to the City Commission concerning the request to amend Ordinance No. 3050. The proposed Ordinance would amend the 2025 Future Land Use Map of the Kissimmee Comprehensive Plan by changing the land use classification for the area described below as follows: FROM: REC (Recreation) - City TO: INST (Institutional) - City The subject property is located at 2001 Yates RD. Legal Description: Parcel 1: 18-25-29-0000-0180-0000 N1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB Together with Parcel 2: 18-25-29-0000-0185-0000 S1/2 OF: BEG AT SW COR OF NE 1/4 OF SW 1/4, N 672 FT, E TO SHINGLE CREEK, S ALONG SHINGLE CREEK TO S/L OF SAID QUARTER, W TO POB The purpose of this public hearing is to consider a proposed amendment to Ordinance 3050, known as the Comprehensive Development Plan, which would change the 2025 Future Land Use Map of the Kissimmee Comprehensive Plan. The proposed amendment and the supporting documents, including a parcel description, may be inspected in the Development Services Department, City Hall, 101 Church Street, Kissimmee, Florida, between 8:00 a.m. and 5:00 p.m., Monday through Friday. Please direct any questions to the Development Services Department, (407) 518-2140 or planning@kissimmee.gov .  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person.  Reference # DRC LUPA-25-0003 CITY COMMISSION Yates Road KISSIMMEE, FLORIDA In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the City Commission with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made. In accordance with Florida Statute 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the  CITY OF KISSIMMEE NOTICE OF PUBLIC HEARING NOTICE OF LAND USE CHANGE  7894539",
      "pub_date": "2025-11-11",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/56/11390856.pdf",
      "link": "https://floridapublicnotices.com/notices/11390856",
      "image_url": null,
      "thumbnail_url": "thumbnails/11390856.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": null,
      "property_address": "2001 Yates RD",
      "zoning_change": "REC (Recreation) - → INST (Institutional) -",
      "reference_num": "DRC",
      "parcel_id": "18-25-29-0000-0180-0000 and 18-25-29-0000-0185-0000",
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Tue, 11 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 11, 2025",
      "first_seen": "2025-11-11T18:21:09.007554+00:00",
      "last_seen": "2025-12-15T18:22:00.605173+00:00"
    },
    "11392587": {
      "id": 11392587,
      "title": "CU-25-0021 - 905 W Oak St",
      "description": "Notice at 905 W Oak St",
      "notice_text": "NOTICE OF PUBLIC HEARING CITY COMMISSION   The City Commission will hold a Public Hearing on Tuesday, November 18, 2025 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida 34741 to consider a Pain Management License for Viva Pharmacy.  The subject property is located at 905 W Oak St. Parcel ID: 21-25-29-1420-0001- 0270  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person. Any questions regarding this public hearing may be directed to the Development Services Department at (407) 518-2140 or at planning@kissimmee.gov  Reference # CU-25-0021  Kissimmee Pharmacy  CITYCOMMISSION KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk 847-2821 #2309 prior to the meeting. (FS 286.26)  In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.   11/12/2025 7894836",
      "pub_date": "2025-11-12",
      "pdf_url": null,
      "link": "https://floridapublicnotices.com/notices/11392587",
      "image_url": null,
      "thumbnail_url": null,
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Government Publications - Notices of Hearings",
      "meeting_date": "Tuesday, November 18, 2025 at 6:00 p.m.",
      "property_address": "905 W Oak St",
      "zoning_change": null,
      "reference_num": "CU-25-0021",
      "parcel_id": "21-25-29-1420-0001- 0270  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person. Any questions regarding this public hearing may be directed to the Development Services Department at (407) 518-2140 or at planning@kissimmee.gov  Reference # CU-25-0021  Kissimmee Pharmacy  CITYCOMMISSION KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk 847-2821 #2309 prior to the meeting. (FS 286.26)  In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.   11/12/2025 7894836",
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Wed, 12 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 12, 2025",
      "first_seen": "2025-11-12T18:20:23.673698+00:00",
      "last_seen": "2025-12-16T18:21:45.612373+00:00"
    },
    "11392586": {
      "id": 11392586,
      "title": "Government Publications - Notices of Hearings - Orlando",
      "description": "Notice at 1080 Kevstin Dr",
      "notice_text": "NOTICE OF PUBLIC HEARING CITY COMMISSION   The City Commission will hold a Public Hearing on Tuesday, November 18, 2025 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida 34741 to consider a Pain Management License for Viva Pharmacy.  The subject property is located at 1080 Kevstin Dr., Suite B. Parcel ID: 22-25-29-00U0-0015-0000  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person. Any questions regarding this public hearing may be directed to the Development Services Department at (407) 518-2140 or at planning@kissimmee.gov .  Avita Pharmacy CITYCOMMISSION KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk 847-2821 #2309 prior to the meeting. (FS 286.26)  In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.   11/12/2025 7894833",
      "pub_date": "2025-11-12",
      "pdf_url": null,
      "link": "https://floridapublicnotices.com/notices/11392586",
      "image_url": null,
      "thumbnail_url": null,
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Government Publications - Notices of Hearings",
      "meeting_date": "Tuesday, November 18, 2025 at 6:00 p.m.",
      "property_address": "1080 Kevstin Dr",
      "zoning_change": null,
      "reference_num": null,
      "parcel_id": "22-25-29-00U0-0015-0000  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person. Any questions regarding this public hearing may be directed to the Development Services Department at (407) 518-2140 or at planning@kissimmee.gov .  Avita Pharmacy CITYCOMMISSION KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk 847-2821 #2309 prior to the meeting. (FS 286.26)  In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.   11/12/2025 7894833",
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Wed, 12 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 12, 2025",
      "first_seen": "2025-11-12T18:20:23.673698+00:00",
      "last_seen": "2025-12-16T18:21:45.612373+00:00"
    },
    "11399370": {
      "id": 11399370,
      "title": "ZMA-25-0003 - 4200 W Vine St",
      "description": "Rezoning at 4200 W Vine St: Vine Street West MUPUD (Mixed Use Planned Urban Development) → T5-U (Mixed Use Urban Corridor)",
      "notice_text": "11/19/2026 The City Commission will consider a request to amend the Official Zoning Map referenced in Ordinance No. 3110 known as the Land Development Code of the City of Kissimmee rezoning the property hereinafter described as follows: FROM: Vine Street West MUPUD (Mixed Use Planned Urban Development)  City TO: T5-U (Mixed Use Urban Corridor)  City The subject property is located at 4200 W Vine St Parcel ID: 19-25-29-00U0-0116- 0000, 19-25-29-00U0-0115-0000, 19-25-29-00U0-0110-0000 and 19-25-29-00U0- 0120-0000 Legal Descriptions: BEG AT INT W/L OF NE 1/4 AND S R/W HWY 192, E 275 FT, S 218 FT, W 275 FT, N 218 FT TO POB 1.369 acres, more or less COM NW COR OF NE 1/4, S 133.71 FT TO S R/W US-192, CONT S 211.27 FT, E 30 FT TO POB; CONT E 213.68 FT, S 188.71 FT, W 212.51 FT, N 188.72 FT TO POB 0.923 acres, more or less W 275 FT OF S 539.34 FT OF N 673.05 FT OF NW 1/4 OF NE 1/4 LESS: COM NW COR OF NE 1/4, S 133.71 FT TO S R/W US-192, CONT S 211.27 FT, E 30 FT TO POB; CONT E 213.68 FT, S 188.71 FT, W 212.51 FT, N 188.72 FT TO POB AND LESS COM INT OF W/L OF NE 1/4 & S R/W HWY 192, E 275 FT, S 218 FT, W 275 FT, N 218 FT TO POB 1.07 acres, more or less W 243 FT OF N 214.05 FT OF N 1/2 OF S 1/2 OF NW 1/4 OF NE 1/4 1.167 acres, more or less PROPOSED ORDINANCE #25-13: AN ORDINANCE AMENDING ORDINANCE NO. 3110 KNOWN AS THE CITY OF KISSIMMEE LAND DEVELOPMENT CODE, REZONING THE PROPERTY HEREINAFTER DESCRIBED, REPEALING ALL ORDINANCES IN CONFLICT HEREWITH AND PROVIDING AN EFFECTIVE DATE. The City Commission will hold a Public Hearing on Tuesday, December 2, 2025 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida, and will consider the adoption of an Ordinance to rezone the above described property following the public hearing. A copy of the proposed Ordinance may be inspected in the office of the Development Services Department at City Hall, 101 Church Street. All interested parties may appear  and be heard on the above date. Written opinion will be received until 5:30 p.m., Tuesday, December 2, 2025. Any questions may be directed to the Development Services Department at (407) 518-2140 or planning@kissimmee.gov. Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or meeting may be heard by participating in person.  Reference # ZMA-25-0003 CITY COMMISSION 4200 W Vine St. Zoning KISSIMMEE, FLORIDA  NOTICE OF PUBLIC HEARING CITY COMMISSION  7897216",
      "pub_date": "2025-11-19",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/70/11399370.pdf",
      "link": "https://floridapublicnotices.com/notices/11399370",
      "image_url": null,
      "thumbnail_url": "thumbnails/11399370.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": "Tuesday, December 2, 2025 at 6:00 p.m.",
      "property_address": "4200 W Vine St",
      "zoning_change": "Vine Street West MUPUD (Mixed Use Planned Urban Development) → T5-U (Mixed Use Urban Corridor)",
      "reference_num": "ZMA-25-0003",
      "parcel_id": "19-25-29-00U0-0116- 0000, 19-25-29-00U0-0115-0000, 19-25-29-00U0-0110-0000 and 19-25-29-00U0- 0120-0000",
      "amendment_type": {
        "code": "ZMA",
        "name": "Zoning Map Amendment"
      },
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Wed, 19 Nov 2025 00:00:00 +0000",
      "pub_date_formatted": "November 19, 2025",
      "first_seen": "2025-11-19T18:20:02.608428+00:00",
      "last_seen": "2025-12-23T18:21:20.006658+00:00"
    },
    "11413367": {
      "id": 11413367,
      "title": "ZMA-25-0007 - 201 E Dakin St",
      "description": "Rezoning at 201 E Dakin St: T5-M (Mixed Use Center) → T6 (Waterfront)",
      "notice_text": "12/3/2025 The City Commission will consider a request to amend the Official Zoning Map referenced in Ordinance No. 3110 known as the Land Development Code of the City of Kissimmee rezoning the property hereinafter described as follows: FROM: T5-M (Mixed Use Center)  City TO: T6 (Waterfront)  City The subject property is located at 201 E Dakin St., Parcel ID: 22-25-29-1591-0001- 0030 Legal Description: LAKEFRONT COMPLEX PB 21 PG 152 LOTS 2 & 3 LESS COM AT PT ON INTER OF NLY LINE OF LAKESHORE BLVD & WLY LINE OF LOT 3, N46-39-56W 335.86 FT, S43- 20-04W 4 FT TO POB; CONT S43-20-04W 66 FT, N46-39-56W 21.55 FT, N48-39-18E 66.16 FT, S47-09-44E 15.41 FT TO POB PROPOSED ORDINANCE #25-17: AN ORDINANCE AMENDING ORDINANCE NO. 3110 KNOWN AS THE CITY OF KISSIMMEE LAND DEVELOPMENT CODE, REZONING THE PROPERTY HEREINAFTER DESCRIBED, REPEALING ALL ORDINANCES IN CONFLICT HEREWITH AND PROVIDING AN EFFECTIVE DATE. The City Commission will hold a Public Hearing on Tuesday, January 6, 2026 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida, and will consider the adoption of an Ordinance to rezone the above described property following the public hearing. A copy of the proposed Ordinance may be inspected in the office of the Development Services Department at City Hall, 101 Church Street. All interested parties may appear and be heard on the above date. Written opinion will be received until 5:30 p.m., Tuesday, January 6, 2026. Any questions may be directed to the Development Services Department at (407) 518-2140 or planning@kissimmee.gov. Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or meeting may be heard by participating in person.  Reference # ZMA-25-0007 CITY COMMISSION 201 E. Dakin St. Zoning KISSIMMEE, FLORIDA  In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk (407) 518-2308 prior to the meeting. (FS286.26) In accordance with Florida Statues 286.0105: Any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.  NOTICE OF PUBLIC HEARING CITY COMMISSION  7901512",
      "pub_date": "2025-12-03",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/67/11413367.pdf",
      "link": "https://floridapublicnotices.com/notices/11413367",
      "image_url": null,
      "thumbnail_url": "thumbnails/11413367.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": "Tuesday, January 6, 2026 at 6:00 p.m.",
      "property_address": "201 E Dakin St",
      "zoning_change": "T5-M (Mixed Use Center) → T6 (Waterfront)",
      "reference_num": "ZMA-25-0007",
      "parcel_id": "22-25-29-1591-0001- 0030",
      "amendment_type": {
        "code": "ZMA",
        "name": "Zoning Map Amendment"
      },
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Wed, 03 Dec 2025 00:00:00 +0000",
      "pub_date_formatted": "December 03, 2025",
      "first_seen": "2025-12-03T18:22:30.236504+00:00",
      "last_seen": "2026-01-06T18:21:19.878487+00:00"
    },
    "11414805": {
      "id": 11414805,
      "title": "ZMA-25-0009 - 2220 Fortune Rd",
      "description": "Rezoning at 2220 Fortune Rd: RC-1 (Multi Family Medium Density Residential) → RC-2 (Multi Family Medium Density Residential)",
      "notice_text": "12/4/2025 The City Commission will consider a request to amend the Official Zoning Map referenced in Ordinance No. 3110 known as the Land Development Code of the City of Kissimmee rezoning the property hereinafter described as follows: FROM: RC-1 (Multi Family Medium Density Residential)  City TO: RC-2 (Multi Family Medium Density Residential)  City The subject property is located at 2220 Fortune Rd. Parcel ID: 19-25-30-00U0-0050- 0000 Legal Description: N 1/2 OF NW 1/4 & NW 1/4 OF SE 1/4 OF NW 1/4 LESS SE 1/4 OF NE 1/4 OF NW 1/4 & LESS RD R/W & LESS R/W SUNSHINE ST PKWY & LESS RD R/W & LESS COM AT N 1/4 COR, S 669.97 FT, W 65 FT TO PT ON N/L COUNTRY CROSSING UNIT 3 PB 7 PG 32-33 & POB; CONT W 587.34 FT TO NW COR COUNTRY CROSSING UNIT 3, N 619.95 FT TO S R/W BOGGY CREEK RD, E 42.42 FT, S 10 FT, E 494.73 FT TO POC, CURVE RIGHT, RAD 50 FT, CENT ANG 89 DEG, SELY ALONG CURVE 78.05 FT, S 555.25 FT TO POB & LESS BEG AT SW COR OF LOT 2, OWEN REPLAT PB 17 PG 173, N00-17-02W 615.52 FT TO PT ON S/L OF PARCEL 103 ADDL R/W TAKING PER OR 5910/941, N89-45-58W 30 FT, S00-16-51E 614.18 FT, S89-43-09W 154 FT, S00- 16-51E 754 FT, N89-43-09E 183.99 FT TO PT ON W/L OF COUNTRY CROSSING UNIT 3 PB 7 PGS 32-33, N00-16-40W 752.39 FT TO POB LESS COM AT NW COR OF NW 1/4 OF 19-25-30, S00-02-46E 900.18 FT TO POC, CONC SWLY, (CH BEARING S37- 15-49E 124.48 FT), SELY ALONG CURVE 124.48 FT TO POB; N53-25-26E 60.99 FT, N05-46-00E 16.31 FT, N00-51-30E 64.07 FT, N80-13-10E 797.42FT S13-56-02E 606.15 FT, S89-41-58W 738.41 FT, N35-38-11W 312.97 FT TO POC, CONC SWLY, RAD 5929.58 FT, CENT ANG 01 DEG, (CH BEARING N36-08-57W 106.17 FT), NWLY ALONG CURVE 106.17 FT TO POB. PROPOSED ORDINANCE #25-20: AN ORDINANCE AMENDING ORDINANCE NO. 3110 KNOWN AS THE CITY OF KISSIMMEE LAND DEVELOPMENT CODE, REZONING THE PROPERTY HEREINAFTER DESCRIBED, REPEALING ALL ORDINANCES IN CONFLICT HEREWITH AND PROVIDING AN EFFECTIVE DATE. The City Commission will hold a Public Hearing on Tuesday, December 16, 2025 at 6:00 p.m. in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida, and will consider the adoption of an Ordinance to rezone the above described property following the public hearing. A copy of the proposed Ordinance may be inspected in the office of the Development Services Department at City Hall, 101 Church Street. All interested parties may appear and be heard on the above date. Written opinion will be received until 5:00 p.m., Tuesday, December 16, 2025. Any questions may be directed to the Development Services Department at (407) 518-2140 or planning@kissimmee.gov.  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or meeting may be heard by participating in person.  Reference # ZMA-25-0009 CITY COMMISSION Fortune Rd. Rezoning KISSIMMEE, FLORIDA In accordance with Florida Statutes 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk (407) 518-2308 prior to the meeting. (FS286.26) In accordance with Florida Statues 286.0105: Any person wishing to appeal any decision made by the Planning Advisory Board with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.  NOTICE OF PUBLIC HEARING CITY COMMISSION  7903145",
      "pub_date": "2025-12-04",
      "pdf_url": "https://dgfc4k3gho5kh.cloudfront.net/05/11414805.pdf",
      "link": "https://floridapublicnotices.com/notices/11414805",
      "image_url": null,
      "thumbnail_url": "thumbnails/11414805.jpg",
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Miscellaneous Notices",
      "meeting_date": "Tuesday, December 16, 2025 at 6:00 p.m.",
      "property_address": "2220 Fortune Rd",
      "zoning_change": "RC-1 (Multi Family Medium Density Residential) → RC-2 (Multi Family Medium Density Residential)",
      "reference_num": "ZMA-25-0009",
      "parcel_id": "19-25-30-00U0-0050- 0000",
      "amendment_type": {
        "code": "ZMA",
        "name": "Zoning Map Amendment"
      },
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Thu, 04 Dec 2025 00:00:00 +0000",
      "pub_date_formatted": "December 04, 2025",
      "first_seen": "2025-12-04T18:22:49.519275+00:00",
      "last_seen": "2026-01-07T18:22:12.657531+00:00"
    },
    "11424093": {
      "id": 11424093,
      "title": "Government Publications - Notices of Hearings - Orlando",
      "description": "CITY OF KISSIMMEE NOTICE OF PUBLIC HEARING   The City Commission will hold a Public Hearing on Tuesday, January 6, 2026 at 6:00 p",
      "notice_text": "CITY OF KISSIMMEE NOTICE OF PUBLIC HEARING   The City Commission will hold a Public Hearing on Tuesday, January 6, 2026 at 6:00 p.m. or as soon thereafter as possible, in the Commission Chambers of City Hall, 101 Church Street, Kissimmee, Florida to consider a Pain Management License for Pharm Aid.  The subject property is located 1341 E. Vine Street; Parcel ID#14-25-29-00U0-0302- 0000.  Any interested party wanting to be heard on this issue may submit testimony to be read into the official record to CityClerkEmail@kissimmee.gov prior to the start of the meeting or may be heard by participating in person. Any questions regarding this public hearing may be directed to the Development Services Department at (407) 518-2140 or at planning@kissimmee.gov.  In accordance with Florida Statutes 286.0105: any person wishing to appeal any decision made by the City Commission with respect to any matter considered at such meeting or hearing will need a record of the proceedings, and for such purposes may need to ensure that a verbatim record of the proceeding is made, which record includes the testimony and evidence upon which the appeal is made.  In accordance with Florida Statute 286.26, persons needing assistance to participate in any of these proceedings should contact the Office of the City Clerk (407) 518-2308 prior to the meeting. (FS286.26)   12/15/2025 7907983",
      "pub_date": "2025-12-15",
      "pdf_url": null,
      "link": "https://floridapublicnotices.com/notices/11424093",
      "image_url": null,
      "thumbnail_url": null,
      "newspaper": "Orlando Sentinel",
      "city": "Orlando",
      "subcategory": "Government Publications - Notices of Hearings",
      "meeting_date": "Tuesday, January 6, 2026 at 6:00 p.m.",
      "property_address": null,
      "zoning_change": null,
      "reference_num": null,
      "parcel_id": null,
      "amendment_type": null,
      "meeting_body_key": "city-commission",
      "meeting_body_name": "City Commission",
      "pub_date_rfc822": "Mon, 15 Dec 2025 00:00:00 +0000",
      "pub_date_formatted": "December 15, 2025",
      "first_seen": "2025-12-15T18:22:00.605173+00:00",
      "last_seen": "2026-01-10T12:26:07.530368+00:00"
    }
  }
}